In [28]:
# 멀티 인덱스
# 라이브러리 불러오기
import pandas as pd

# titanic 데이터셋에서 age, fare등 5개 열을 선택하여 데이터프레임 만들기
import seaborn as sns

titanic = sns.load_dataset('titanic')
df = titanic.loc[:, ['age', 'sex', 'class', 'fare', 'survived']]

# class 열을 기준으로 분리
grouped = df.groupby(['class', 'sex'], observed=True)
print(grouped)

# 그룹 객체에 연산 메소드 적용
gdf=grouped.agg(['mean', 'std'], numeric_only=True)
gdf

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x000001FBA8C25450>

                     age                   fare             survived
                    mean        std        mean        std      mean       std
class  sex
First  female  34.611765  13.612052  106.125798  74.259988  0.968085  0.176716
       male    41.281386  15.139570   67.226127  77.548021  0.368852  0.484484
Second female  28.722973  12.872702   21.970121  10.891796  0.921053  0.271448
       male    30.740707  14.793894   19.741782  14.922235  0.157407  0.365882
Third  female  21.750000  12.729964   16.118810  11.690314  0.500000  0.501745
       male    26.507589  12.159514   12.661633  11.681696  0.135447  0.342694

In [36]:
# 미션 8-1
# class와 sex를 기준으로 멀티 인덱스 생성
df_multi = df.set_index(['class', 'sex'])

# 결과
print(df_multi.head())

               age     fare  survived
class sex
Third male    22.0   7.2500         0
First female  38.0  71.2833         1
Third female  26.0   7.9250         1
First female  35.0  53.1000         1
Third male    35.0   8.0500         0

In [3]:
# 인덱스 속성 확인하기
gdf.index

MultiIndex([( 'First', 'female'),
            ( 'First',   'male'),
            ('Second', 'female'),
            ('Second',   'male'),
            ( 'Third', 'female'),
            ( 'Third',   'male')],
           names=['class', 'sex'])

In [6]:
# 멀티 인덱스 만들기 - 배열의 리스트 이용
arrays = [['a', 'a', 'b', 'b'], [1, 2, 1, 2]]
multi_index_arrays = pd.MultiIndex.from_arrays(arrays, names = ('letter', 'number'))
multi_index_arrays

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           names=['letter', 'number'])

In [7]:
# 멀티 인덱스 만들기 - 튜플의 배열 이용
tuples = [('a', 1), ('a', 2), ('b', 1), ('b', 2)]
multi_index_tuples = pd.MultiIndex.from_tuples(tuples, names = ('letter', 'number'))
multi_index_tuples

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           names=['letter', 'number'])

In [12]:
# 멀티 인덱스 만들기 - 교차 반복 객체를 이용
letters = ['a', 'b']
number = [1, 2]
multi_index_product = pd.MultiIndex.from_product([letters, number], names=('letter', 'number'))

multi_index_product

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           names=['letter', 'number'])

In [13]:
# 멀티 인덱스 만들기 - 데이터프레임을 이용
df=pd.DataFrame([['a',1], ['a', 2], ['b', 1], ['b',2]], columns = ['letter', 'number'])
multi_index_frame = pd.MultiIndex.from_frame(df)
multi_index_frame

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           names=['letter', 'number'])

In [14]:
# 멀티인덱스의 특정 레벨을 추출
multi_index_frame.get_level_values(0)

Index(['a', 'a', 'b', 'b'], dtype='object', name='letter')

In [15]:
# 멀티인덱스의 특정 레벨을 추출
multi_index_frame.get_level_values('letter')

Index(['a', 'a', 'b', 'b'], dtype='object', name='letter')

In [37]:
## 미션 8-2
# 멀티 인덱스로 설정
df_multi = df.set_index(['class', 'sex'])

# ('First', 'female') 그룹의 age 평균
mean_age = df_multi.loc[('First', 'female'), 'age'].mean()

print(f"(First, female)의 age 평균: {mean_age:.2f}")

(First, female)의 age 평균: 34.61

C:\Users\1\AppData\Local\Temp\ipykernel_25740\1948123334.py:5: PerformanceWarning: indexing past lexsort depth may impact performance.
  mean_age = df_multi.loc[('First', 'female'), 'age'].mean()

In [16]:
# 열 이름의 멀티 인덱스 확인
gdf.columns.levels

FrozenList([['age', 'fare', 'survived'], ['mean', 'std']])

In [17]:
# 레벨을 지정하여 열 인덱스 추출
gdf.columns.get_level_values(0)

Index(['age', 'age', 'fare', 'fare', 'survived', 'survived'], dtype='object')

In [18]:
# 레벨을 지정하여 열 인덱스 추출
gdf.columns.get_level_values(1)

Index(['mean', 'std', 'mean', 'std', 'mean', 'std'], dtype='object')

In [19]:
# age 변수의 데이터를 선택
gdf['age']

                    mean        std
class  sex
First  female  34.611765  13.612052
       male    41.281386  15.139570
Second female  28.722973  12.872702
       male    30.740707  14.793894
Third  female  21.750000  12.729964
       male    26.507589  12.159514

In [20]:
# age 변수의 평균값 데이터를 선택
gdf['age', 'mean']

class   sex
First   female    34.611765
        male      41.281386
Second  female    28.722973
        male      30.740707
Third   female    21.750000
        male      26.507589
Name: (age, mean), dtype: float64

In [21]:
# age 변수를 먼저 선택하고, 다시 평균값 데이터를 선택
gdf['age']['mean']

class   sex
First   female    34.611765
        male      41.281386
Second  female    28.722973
        male      30.740707
Third   female    21.750000
        male      26.507589
Name: mean, dtype: float64

In [22]:
# class 값이 First인 행을 선택
gdf.loc['First']

              age                   fare             survived
             mean        std        mean        std      mean       std
sex
female  34.611765  13.612052  106.125798  74.259988  0.968085  0.176716
male    41.281386  15.139570   67.226127  77.548021  0.368852  0.484484

In [23]:
# class  값이 First고, sex 값이 female인 행을 선택
gdf.loc[('First', 'female')]

age       mean     34.611765
          std      13.612052
fare      mean    106.125798
          std      74.259988
survived  mean      0.968085
          std       0.176716
Name: (First, female), dtype: float64

In [24]:
# class 값이 First이고, sex 값이 female인 행의 'age' 열을 선택
gdf.loc[('First', 'female'), 'age']

mean    34.611765
std     13.612052
Name: (First, female), dtype: float64

In [25]:
# class 값이 First이고, sex 값이 female인 행의 'age' 열의 'mean' 선택
gdf.loc[('First', 'female'), ('age', 'mean')]

np.float64(34.61176470588235)

In [26]:
# First이고 female인 행의 'age' 열의 'std'부터 'fare'열의 'mean'열까지의 범위 선택
gdf.loc[('First', 'female'), ('age', 'std'):('fare', 'mean')]

age   std      13.612052
fare  mean    106.125798
Name: (First, female), dtype: float64

In [31]:
# 특정 레벨에서 교차 섹션(cross-section) 이용 - sex 값이 male인 데이터를 선택
male_class = gdf.xs('male', level='sex')
male_class

              age                  fare             survived
             mean        std       mean        std      mean       std
class
First   41.281386  15.139570  67.226127  77.548021  0.368852  0.484484
Second  30.740707  14.793894  19.741782  14.922235  0.157407  0.365882
Third   26.507589  12.159514  12.661633  11.681696  0.135447  0.342694

In [38]:
## 미션 8-3
# 'sex' 레벨에서 'male' 값만 추출
male_passengers = df_multi.xs(key='male', level='sex')

print(male_passengers.head())

        age     fare  survived
class
Third  22.0   7.2500         0
Third  35.0   8.0500         0
Third   NaN   8.4583         0
First  54.0  51.8625         0
Third   2.0  21.0750         0

In [32]:
## 데이터 정렬
# 멀티인덱스 정렬
gdf.sort_index(level=0, ascending=False)

                     age                   fare             survived
                    mean        std        mean        std      mean       std
class  sex
Third  male    26.507589  12.159514   12.661633  11.681696  0.135447  0.342694
       female  21.750000  12.729964   16.118810  11.690314  0.500000  0.501745
Second male    30.740707  14.793894   19.741782  14.922235  0.157407  0.365882
       female  28.722973  12.872702   21.970121  10.891796  0.921053  0.271448
First  male    41.281386  15.139570   67.226127  77.548021  0.368852  0.484484
       female  34.611765  13.612052  106.125798  74.259988  0.968085  0.176716

In [33]:
# 멀티 인덱스 정렬
gdf.sort_index(level='sex', ascending=False)

                     age                   fare             survived
                    mean        std        mean        std      mean       std
class  sex
Third  male    26.507589  12.159514   12.661633  11.681696  0.135447  0.342694
Second male    30.740707  14.793894   19.741782  14.922235  0.157407  0.365882
First  male    41.281386  15.139570   67.226127  77.548021  0.368852  0.484484
Third  female  21.750000  12.729964   16.118810  11.690314  0.500000  0.501745
Second female  28.722973  12.872702   21.970121  10.891796  0.921053  0.271448
First  female  34.611765  13.612052  106.125798  74.259988  0.968085  0.176716

In [35]:
# 멀티 인덱스 정렬
gdf.sort_index(level=['sex', 'class'], ascending=[False, True])

                     age                   fare             survived
                    mean        std        mean        std      mean       std
class  sex
First  male    41.281386  15.139570   67.226127  77.548021  0.368852  0.484484
Second male    30.740707  14.793894   19.741782  14.922235  0.157407  0.365882
Third  male    26.507589  12.159514   12.661633  11.681696  0.135447  0.342694
First  female  34.611765  13.612052  106.125798  74.259988  0.968085  0.176716
Second female  28.722973  12.872702   21.970121  10.891796  0.921053  0.271448
Third  female  21.750000  12.729964   16.118810  11.690314  0.500000  0.501745

In [30]:
# 1. 라이브러리 불러오기
import pandas as pd
import seaborn as sns

# 2. 데이터 로드 및 필요한 열 선택
titanic = sns.load_dataset('titanic')
df = titanic.loc[:, ['age', 'sex', 'class', 'fare', 'survived']]

# 3. 유일한 값 추출하여 리스트 생성
classes = df['class'].unique().tolist()
sexes = df['sex'].unique().tolist()

# 4. from_product를 사용해 멀티 인덱스 생성
multi_index = pd.MultiIndex.from_product(
    [classes, sexes],
    names=['class', 'sex']
)

# 5. 멀티 인덱스를 활용한 예제용 데이터프레임 생성
dummy_df = pd.DataFrame(
    data={'sample_value': range(len(multi_index))},
    index=multi_index
)

# 6. 출력
print(dummy_df)

               sample_value
class  sex
Third  male               0
       female             1
First  male               2
       female             3
Second male               4
       female             5